[
    ["“I can’t wait!” Sami cried as he helped his family pack the car.", "“I’m going to swim in the sea! I’ve been practicing in the swimming pool!” “You have,” Mum agreed, smiling. “We’ll have a lovely holiday!”"],
    ["“I’m going to love the beach!” Sami exclaimed, excited because he had never been before.", "“I know!” his younger brother said. “You’ve watched sooo many beach programmes lately! What’s that phrase you keep saying?”", "“Float to Live!” Sami said in a big voice like the lifeguards in the programme."],
    ["He gazed out of the window, hoping to see the sea first! At last, the family arrived at the beach and spilled out of the car.", "“Race you!” Sami called to his brother, grabbing his toy boat.", "They ran across the beach, hearing the warm sand squeaking under their feet. Laughing, they collapsed in a heap."],
    ["This is the best day ever!", "Sami thought to himself, finding a little river flowing gently across the sand. He put his boat in and started following it down towards the sea, leaving his family eating their picnic behind him."],
    ["His boat had reached the waves of the sea. Putting it to one side, Sami started to splash and jump in the gentle waves.", "Brrrr! It was pretty cold and he had never done this before. Each time a wave got a little bigger Sami felt a little braver."],
    ["Soon he was in some really good waves, doing super-cool jumps and having a great time! This is so different to the swimming pool, he thought, looking to see if his family were watching him, but they were too far away and he couldn’t see them."],
    ["Suddenly, on the next big wave, he realised his feet couldn’t touch the bottom."],
    ["He had to swim up over the next wave to catch his breath! Another wave came, then another. Sami swam forwards to meet them so they wouldn’t crash over his head.", "Before he knew it, he was quite a long way from the beach.", "Struggling to stay afloat, Sami knew the waves were too big for him to swim against. He tried for a while, but his legs grew tired. What should he be doing? He couldn’t remember – Swim or float? The beach was getting further away. Sami wanted to swim towards it but the waves and currents were too strong and pushed him further out."],
    ["He flipped over onto his back and floated for a while like a starfish and rested. He thought of everything he had read about the sea and what he had seen on TV.", "Then he remembered – Float to Live!", "“If ever you’re in danger in the water, Float to Live!” the lifeguard on the programme had said."],
    ["Float to Live. Float to Live. Float to Live. The words kept coming back to him.", "Sami lay looking up at the blue sky, his ears under the water, arms and legs spread wide, his hands and feet moving gently from side to side.", "Someone will come, someone will see and I will be rescued soon. Float to Live.", "The waves were calmer now as he floated and rested, listening to the sounds of the seagulls calling around him. That gave him the idea to start calling for help and he looked for a way to save himself. He shouted out and raised his arm in the air, slowly trying to paddle towards the rocky shore."],
    ["Meanwhile, back on the beach, his family had finished their picnic.", "“Can we go for a swim now please?” Sami’s brother asked.", "“Yes, later.” Dad replied. “Why don’t you go and play with Sami in the river?”", "“But Sami isn’t there!” his brother replied."],
    ["“I’ve looked for him everywhere!” Quickly, Sami’s parents started searching for their son.", "With hundreds of people on the beach, they realised they needed help, so ran to the lifeguards to ask if they had seen him.", "“He is 10 years old, has brown hair, red swimming shorts and might have a boat with him.”"],
    ["“We found this boat by the sea’s edge,” said one of the lifeguards. “Is it Sami’s?”", "“Yes! Does this mean he’s in the sea? Oh no!” Sami’s mum cried. “He can swim but hasn’t been in the sea before! You must find him!”"],
    ["“We will find him, don’t worry. You stay on the beach and keep looking. We will call the boats and helicopter; they will find him. He’ll be back here before you know it.”"],
    [""],
    ["As soon as the lifeguard called for help, the rescue and coastguard teams sprang into action.", "The helicopter and boats quickly arrived and began their search, whilst Sami’s parents continued to look amongst the crowds. The fast boat drove back and forth along the beach. The helicopter scanned the sea from above.", "Time was ticking, they hadn’t found Sami"],
    ["“Help!” Sami heard the helicopter. “I’m over here!”"],
    ["He was a long way out. Would anyone hear him?", "Sami was still floating, but every now and then he called for help and held up his arm, trying to save his energy as he was getting really tired and cold.", "He knew they were going to find him, but he wished they would hurry up. He hadn’t had his lunch yet and was looking forward to the picnic his family had made."],
    ["I wish I hadn’t gone in by myself, he thought. I wish I had waited for Mum and Dad.", "I wish I had swum where all the other people were, in between the red and yellow flags. I wish they’d hurry!"],
    ["“He’s here!”", "Sami heard an excited voice behind him as the sound of a boat engine got closer."],
    ["“Hello, Sami, we are the rescue team!” one of the crew called.", "“We’ve got you, you’re safe.”"],
    ["“Let’s pull him in. One, two, three!”", "Those voices were the best sounds in the world to Sami. The boat bobbed carefully beside him and strong arms reached down, hauling him to safety. He tried to help climb up but he was too weak and shivering.", "“Put this round him,” one of the crew suggested.", "Before he knew it, Sami was in the boat, wrapped in blankets and heading at full speed back to the beach."],
    ["As Sami was carried onto the sand, lots of people were waiting for him. When he lifted his hand to wave to his family, a big cheer went up from everyone."],
    ["“I can’t believe how far out he was!” said one of his rescuers.", "“We found him over by the island floating calmly on his back, doing exactly the right thing.", "If he had tried to swim against the current, he would never have made it. Well done, Sami lad!”"],
    [""],
    ["Sami thanked everyone who had helped save him.", "One of the lifeguards gave him some good advice for next time he went for a swim.", "She said, “You should Stop and Think before going into the water. Go with someone else and Stay Together. Float to Live if you find yourself in trouble. Call 999 if you need help or see someone else who does.”", "There was a lot to remember, but Sami knew it was all very important to help keep safe."],
    ["Finally, Sami allowed himself to lie on the soft warm sand with his family.", "Enjoying his picnic at last, he was very happy to be alive.", "“Float to Live,” he said, “if I hadn’t known that, I wouldn’t be here. Tomorrow, when I go in the sea, I’m going to make sure I do all the right things like the lifeguard said,", "then I can have lots of fun swimming and diving, jumping and splashing in the waves again.”"]
]