{
    "K": {
        "PS": {
            "2": {
                "1": "Plan and conduct an investigation to compare the effects of different strengths or different directions of pushes and pulls on the motion of an object. [Clarification Statement: Examples of pushes or pulls could include a string attached to an object being pulled, a person pushing an object, a person stopping a rolling ball, and two objects colliding and pushing on each other.] [Assessment Boundary: Assessment is limited to different relative strengths or different directions, but not both at the same time. Assessment does not include non-contact pushes or pulls such as those produced by magnets.]",
                "2": "Analyze data to determine if a design solution works as intended to change the speed or direction of an object with a push or a pull.* [Clarification Statement: Examples of problems requiring a solution could include having a marble or other object move a certain distance, follow a particular path, and knock down other objects. Examples of solutions could include tools such as a ramp to increase the speed of the object and a structure that would cause an object such as a marble or ball to turn.] [Assessment Boundary: Assessment does not include friction as a mechanism for change in speed.]"
            },
            "3": {
                "1": "Make observations to determine the effect of sunlight on Earth’s surface. [Clarification Statement: Examples of Earth’s surface could include sand, soil, rocks, and water] [Assessment Boundary: Assessment of temperature is limited to relative measures such as warmer/cooler.]",
                "2": "Use tools and materials to design and build a structure that will reduce the warming effect of sunlight on an area.* [Clarification Statement: Examples of structures could include umbrellas, canopies, and tents that minimize the warming effect of the sun.]"
            }
        },
        "LS": {
            "1": {
                "1": "Use observations to describe patterns of what plants and animals (including humans) need to survive. [Clarification Statement: Examples of patterns could include that animals need to take in food but plants do not; the different kinds of food needed by different types of animals; the requirement of plants to have light; and, that all living things need water.]"
            }
        },
        "ESS": {
            "2": {
                "1": "Use and share observations of local weather conditions to describe patterns over time. [Clarification Statement: Examples of qualitative observations could include descriptions of the weather (such as sunny, cloudy, rainy, and warm); examples of quantitative observations could include numbers of sunny, windy, and rainy days in a month. Examples of patterns could include that it is usually cooler in the morning than in the afternoon and the number of sunny days versus cloudy days in different months.] [Assessment Boundary: Assessment of quantitative observations limited to whole numbers and relative measures such as warmer/cooler.]",
                "2": "Construct an argument supported by evidence for how plants and animals (including humans) can change the environment to meet their needs. [Clarification Statement: Examples of plants and animals changing their environment could include a squirrel digs in the ground to hide its food and tree roots can break concrete.]"
            },
            "3": {
                "1": "Use a model to represent the relationship between the needs of different plants or animals (including humans) and the places they live. [Clarification Statement: Examples of relationships could include that deer eat buds and leaves, threfore, they usually live in forested areas; and, grasses need sunlight so they often grow in meadows. Plants, animals, and their surroundings make up a system.]",
                "2": "Ask questions to obtain information about the purpose of weather forecasting to prepare for, and respond to, severe weather.* [Clarification Statement: Emphasis is on local forms of severe weather.]",
                "3": "Communicate solutions that will reduce the impact of humans on the land, water, air, and/or other living things in the local environment.* [Clarification Statement: Examples of human impact on the land could include cutting trees to produce paper and using resources to produce bottles. Examples of solutions could include reusing paper and recycling cans and bottles.]"
            }
        }
    },
    "1": {
        "PS": {
            "4": {
                "1": "Plan and conduct investigations to provide evidence that vibrating materials can make sound and that sound can make materials vibrate. [Clarification Statement: Examples of vibrating materials that make sound could include tuning forks and plucking a stretched string. Examples of how sound can make matter vibrate could include holding a piece of paper near a speaker making sound and holding an object near a vibrating tuning fork.]",
                "2": "Make observations to construct an evidence-based account that objects can be seen only when illuminated. [Clarification Statement: Examples of observations could include those made in a completely dark room, a pinhole box, and a video of a cave explorer with a flashlight. Illumination could be from an external light source or by an object giving off its own light.]",
                "3": "Plan and conduct an investigation to determine the effect of placing objects made with different materials in the path of a beam of light. [Clarification Statement: Examples of materials could include those that are transparent (such as clear plastic), translucent (such as wax paper), opaque (such as cardboard), and reflective (such as a mirror).] [Assessment Boundary: Assessment does not include the speed of light.]",
                "4": "Use tools and materials to design and build a device that uses light or sound to solve the problem of communicating over a distance.* [Clarification Statement: Examples of devices could include a light source to send signals, paper cup and string “telephones,” and a pattern of drum beats.] [Assessment Boundary: Assessment does not include technological details for how communication devices work.]"
            }
        },
        "LS": {
            "1": {
                "1": "Use materials to design a solution to a human problem by mimicking how plants and/or animals use their external parts to help them survive, grow, and meet their needs.* [Clarification Statement: Examples of human problems that can be solved by mimicking plant or animal solutions could include designing clothing or equipment to protect bicyclists by mimicking turtle shells, acorn shells, and animal scales; stabilizing structures by mimicking animal tails and roots on plants; keeping out intruders by mimicking thorns on branches and animal quills; and, detecting intruders by mimicking eyes and ears.]",
                "2": "Read texts and use media to determine patterns in behavior of parents and offspring that help offspring survive. [Clarification Statement: Examples of patterns of behaviors could include the signals that offspring make (such as crying, cheeping, and other vocalizations) and the responses of the parents (such as feeding, comforting, and protecting the offspring).]"
            },
            "3": {
                "1": "Make observations to construct an evidence-based account that young plants and animals are like, but not exactly like, their parents. [Clarification Statement: Examples of patterns could include features plants or animals share. Examples of observations could include leaves from the same kind of plant are the same shape but can differ in size; and, a particular breed of dog looks like its parents but is not exactly the same.] [Assessment Boundary: Assessment does not include inheritance or animals that undergo metamorphosis or hybrids.]"
            }
        },
        "ESS": {
            "1": {
                "1": "Use observations of the sun, moon, and stars to describe patterns that can be predicted. [Clarification Statement: Examples of patterns could include that the sun and moon appear to rise in one part of the sky, move across the sky, and set; and stars other than our sun are visible at night but not during the day.] [Assessment Boundary: Assessment of star patterns is limited to stars being seen at night and not during the day.]",
                "2": "Make observations at different times of year to relate the amount of daylight to the time of year. [Clarification Statement: Emphasis is on relative comparisons of the amount of daylight in the winter to the amount in the spring or fall.] [Assessment Boundary: Assessment is limited to relative amounts of daylight, not quantifying the hours or time of daylight.]"
            }
        }
    },
    "2": {
        "PS": {
            "1": {
                "1": "Plan and conduct an investigation to describe and classify different kinds of materials by their observable properties. [Clarification Statement: Observations could include color, texture, hardness, and flexibility. Patterns could include the similar properties that different materials share.]",
                "2": "Analyze data obtained from testing different materials to determine which materials have the properties that are best suited for an intended purpose.* [Clarification Statement: Examples of properties could include, strength, flexibility, hardness, texture, and absorbency.] [Assessment Boundary: Assessment of quantitative measurements is limited to length.]",
                "3": "Make observations to construct an evidence-based account of how an object made of a small set of pieces can be disassembled and made into a new object. [Clarification Statement: Examples of pieces could include blocks, building bricks, or other assorted small objects.]",
                "4": "Construct an argument with evidence that some changes caused by heating or cooling can be reversed and some cannot. [Clarification Statement: Examples of reversible changes could include materials such as water and butter at different temperatures. Examples of irreversible changes could include cooking an egg, freezing a plant leaf, and heating paper.]"
            }
        },
        "LS": {
            "2": {
                "1": "Plan and conduct an investigation to determine if plants need sunlight and water to grow. [Assessment Boundary: Assessment is limited to testing one variable at a time.]",
                "2": "Develop a simple model that mimics the function of an animal in dispersing seeds or pollinating plants.*"
            },
            "4": {
                "1": "Make observations of plants and animals to compare the diversity of life in different habitats. [Clarification Statement: Emphasis is on the diversity of living things in each of a variety of different habitats.] [Assessment Boundary: Assessment does not include specific animal and plant names in specific habitats.]"
            }
        },
        "ESS": {
            "1": {
                "1": "Use information from several sources to provide evidence that Earth events can occur quickly or slowly. [Clarification Statement: Examples of events and timescales could include volcanic explosions and earthquakes, which happen quickly and erosion of rocks, which occurs slowly.] [Assessment Boundary: Assessment does not include quantitative measurements of timescales.]"
            },
            "2": {
                "1": "Compare multiple solutions designed to slow or prevent wind or water from changing the shape of the land.* [Clarification Statement: Examples of solutions could include different designs of dikes and windbreaks to hold back wind and water, and different designs for using shrubs, grass, and trees to hold back the land.]",
                "2": "Develop a model to represent the shapes and kinds of land and bodies of water in an area. [Assessment Boundary: Assessment does not include quantitative scaling in models.]",
                "3": "Obtain information to identify where water is found on Earth and that it can be solid or liquid."
            }
        }
    },
    "K2": {
        "ETS": {
            "1": {
                "1": "Ask questions, make observations, and gather information about a situation people want to change to define a simple problem that can be solved through the development of a new or improved object or tool.",
                "2": "Develop a simple sketch, drawing, or physical model to illustrate how the shape of an object helps it function as needed to solve a given problem.",
                "3": "Analyze data from tests of two objects designed to solve the same problem to compare the strengths and weaknesses of how each performs."
            }
        }
    }
}