[
    ["Esther does not believe in magic. Which is kind of a big deal when you are a fairy."],
    ["While the other fairies wish on stars, Esther conducts experiments. While they learn spells, she studies the law of density. She's a fairy who prefers a microscope to a wand."],
    ["Esther is dedicated to science. She and her friends use the scientific method to explore the world around them."],
    ["first they ask a question. Then they do some research."],
    ["They each make a hypothesis. They do experiments, and they examine their results."],
    ["finally they draw their conclusions."],
    ["Esther and her friends try to share their discovery at school. but none of their fairymates are interested."],
    ["They are too busy planning for the Magic fair to listen to her silly logical theories."],
    ["Last year's fair didn't go wel for Esther. It turns out magic enthusiasts are surprisingly clueless."],
    ["While her fairymates work on their magic projects. Esther focuses on solving scientific problems. And there is no bigger problem."],
    ["...than a missing pond!"],
    ["I have mud in my ears! I have mud up my nose! I have mud in ALL the places."],
    ["There are lots of ideas about what happened to the pond."],
    ["But only Esther and her science pals observe the facts."],
    ["Fgi asks a question. Clover does some research. Esther forms a hypothesis."],
    ["Together, they conduct experiments and examine the results."],
    ["At last. they draw their conclusion."],
    ["The pond is up there!"],
    [""],
    ["Since there is no scientific way to force it to rain, Esther and her friends just have to wait to see if her theory is correct."],
    ["They wait and wait and wait a little longer, until finally it starts to pour."],
    ["Eureka! They were right! After a few days of steady rain, the pond is restored. The water cycle is almost magical."],
    ["And, it gives Esther the perfect way to bring science to the Magic fair!"],
    ["I'm gassy! I'm liquid! I'm solid!"],
    ["Did it work? What type of spell makes the water change? Water is a shape-shifter? Does water make everyone gassy?"],
    ["Has Esther finally made everyone excited about science? The winner of this year's Magic Fair is..."],
    ["Blossom Dinglepuff, for her report, \"GLITTER BOOGERS: Make Your Snot Sparkle!\""],
    ["Apparently, the Magic Fair isn't ready for science. But the judges appreciate a good costume. Esther, Clover, and Fig get first place for Best Magic Fair Costume Design! Esther may not have won any trophies, but like all good scientists. she knows that discovery is the best reward."],
    [""],
    ["And there is always something new to discover."]
]