[["Saturday morning I was asleep in my bed, when Newton, my dog, dropped his ball on my head."], ["I pulled on my blue jeans, t-shirt, and shoes and ate a quick breakfast while Dad read the news.", "Then Newton and I ran out the back door. We had the whole day to play and explore."], ["I rolled Newton's ball to him along the ground.As we played with the ball, here's what we found ...", "The ball won't roll far in the rough, grassy yard.", "It rolls much farther on a surface that's smooth and hard.", "But, it won't roll at all if I don't give it a push.", "When I pushed too hard, it rolled as far as the bush."], ["I decided to throw the ball up in the sky. I threw the ball hard. It went really high.", "No matter how hard I would throw the ball up, it would always come down to me and my pup.", "This gave me an idea I wanted to test. I took out the red truck that I like the best.", "I put down the truck on ground that was flat. Until I would push, my truck stayed where it sat."], ["Going downhill my truck really speeds. It went off the sidewalk and up into the weeds."], ["When I pushed my toy truck, it went really far. But even my big push won't move my dad's car."], ["I heard my mom calling for Newton and me. She wanted some rocks from a pile by the tree.", "We pulled my red wagon to the tree at a run. Newton and I knew this job would be fun.", "I filled up my wagon with piles of stone, but with all of the rocks, I couldn't pull it alone."], ["When it was empty, it was easy to pull. I just couldn't move it when it was full.", "Newton and I got some help from my dad. He pushed while I pulled. We made my mom glad."], ["Then Newton and I decided to go for a ride. I hopped on my bike with my dog by my side.", "The wind was blowing quite hard that day. The wind at my back pushed me on my way."], ["I realized at the end of the day that I learned some new things along the way ...", "Playing with Newton gave me the notion that pushing and pulling are forces of motion."], ["But when I turned around to go home at last, the wind pushed against my chest and I couldn't go as fast.", "Pedaling uphill was really hard too. Getting to the top took all I could do."], ["But going downhill, I needed to slow down. I did that by dragging my feet on the ground."], ["When we got home, we played tug-of-war. I pulled, Newton pulled, and then I pulled some more.", "When he pulled as hard as I did, we didn't move at all. But when he pulled harder, I'd step forward or fall."]]