[
    ["Once upon a time, there was a fourth little pig named Penny."],
    ["Ever since she was a piglet ni Hogs' Heaven, Penny dreamed of being an engineer."],
    ["While her three brothers were building their homes, Penny moved to New Pork City. In engineering school, she constructed sets for Swine Lake."],
    ["After graduation, she designed blueprints for the city's Statue of Pigerty. And in her free time, she sketched plans to build the biggest pigtail roller coaster Boar County had ever seen."],
    ["One day, Penny got a cal from her brothers. \"The big bad wolf was here!\" Puck squealed. \"He huffed, and he puffed, and he blew our houses down,\" Pip oinked."],
    ["\"My brick house si still standing.\" Pierre grunted. \"But we need an engineer to evaluate the damage.\""],
    ["\"I can do it!\" Penny volunteered."],
    ["Penny headed straight for the Swine Line. When she arrived in Hogs' Heaven, the neighborhood was a total pigsty!"],
    ["Penny got right to work. She checked the foundation, she double-checked the walls, and she triple-checked the roof. \"Your house is solid.\" she told Pierre. \"With a little grunt work, it'll be as good as new.\""],
    ["Just then, Pierre got a text. \"It's Little Red. She says Wolfgang is on the prowl. Hes' coming back tonight!\" \"He's one doggone bully.\" Pip oinked."],
    ["\"No use swine-ing,\" Puck squealed. \"We gotta stop this hogwash!\" Penny agreed. \"Let's build wolf traps around the house to keep him out.\""],
    ["First, Penny brainstormed ideas. She measured, and she sketched."],
    ["Then, she drew up blueprints for each trap. As soon as the plans were perfected, the four little pigs started building."],
    ["Penny was the head hog. She supervised as ... Puck wove a snare out of straw. Pip built a cage made of sticks. Pierre created a catapult to toss bricks."],
    ["Then, the pigs prepared for battle."],
    ["That night, Wolfgang stomped down the street. \"Little pigs, little pigs . . . I'm back again.\""],
    ["\"You might as wel leave, cause you'll never get in!\" Penny hollered. Wolfgang flexed his muscles. \"I'm big, and Im' tough, and this time, I'll win.\" \"Not by the hair on our pinky pig skin!\" the four little pigs chanted."],
    ["Wolfgang tried to sneak in the window, but Puck pulled the rope and tightened the snare."],
    ["Wolfgang growled and chomped through the rope. Puck squealed and ran off."],
    ["Wolfgang tried to kick down the door, but Pip pulled the lever and dropped the cage."],
    ["Wolfgang howled and broke through the sticks. Pip oinked and hid."],
    ["Wolfgang tried to climb on the roof, but before he reached the top, Pierre released the catapult. The brick flew through the air and landed on Wolfgang's foot."],
    ["\"Owwwww!\" Wolfgang howled. \"You're too pigheaded for me!\" He ran off with his tail between his legs."],
    ["\"That's what he gets for hounding us,\" Puck said. \"We sure gave hmi a ruff time,\" Pip said."],
    ["\"Now that he's ni the doghouse, we can finally rebuild,\" Pierre said. \"Let's build one big house for al of you,\" Penny suggested. \"He'll never blow that down.\""],
    ["Penny drew up the blueprints. Pierre laid the foundation with bricks. Pip built the house with sticks. Puck covered the roof with straw."],
    ["And together, they decorated the interior with piggy things."],
    ["Penny moved back to town and created a stylish house of her own. She finally built the biggest pigtail roller coaster Boar County had ever seen."],
    ["The four little pigs all lived in Hogs' Heaven ... happily ever after. And obviously, Penny was the head hog."]
]