[["When Amara was very small, a bat got trapped in the attic of her old house."], ["Amara asked if she could hold the bat, but her mom and big brother, Samir, told her they should wait for the wild life rescue team.", "They would know how to handle and look after the bat safely."], ["When the wildlife rescue team arrived, they caught the bat carefully and held it very gently in a towel.", "Amara got to see the bat's fluffy face, beady eyes, and delicate wings up close.", "Some people are afraid of bats, but Amara thought they were so cute!"], ["Part of her wished she could keep it as a pet, but Amara knew the bat would be happier out in the wild, where it could fly around and be free."], ["Ever since then, Amara has loved bats!", "Her favorite thing to do is collect all the bat facts she can find and write them in her notebook."], ["Mom, did you know that bats are nocturnal?", "That means they're awake at night.", "They hang upside down, like this!", "And they're the only mammals that can fly!"], ["Amara and her family were moving to a new town.", "She was supposed to be packing up her room, but she kept getting distracted by more bat facts.", "Amara squeaked all around the house.", "\"Samir!", "Did you know that bats have such a high-pitched squeak that we can't even hear them?", "They use echo location to find their food in the dark!\"", "\"I can hear you!\"", "Samir laughed."], ["Amara and her family often watched the bats flying near their old house.", "She knew that all kinds of bats lived all over the world, so no matter where they lived, she'd always be able to see them."], ["After they moved, Amara couldn't wait to visit the park in her new neighborhood to see the bats flying around at sundown."], ["\"Did you know that most bats eat insects or fruit, but some eat fish, frogs, and even flowers?", "They have really long tongues to reach the nectar!", "They are amazing pollinators.\""], ["But when Amara and her family got to the park, there were no bats to be found.", "They asked the park ranger about the bats, but she hadn't seen any in a while."], ["\"We used to have a few bats near by years ago,\" the ranger said sadly.", "\"But it's just me working here now, and more and more of the land is being sold to make room for buildings."], ["Amara felt a sad feeling in her tummy on the way home.", "She couldn't stop thinking about the bats and their habitat.", "There was so much that needed fixing.", "She felt as if the weight of the whole world was crushing down on her.", "What could she do to help?"], ["\"Amara?\"", "Her mom knocked on the door gently.", "\"I unpacked the rest of your books!", "And your new nature magazine arrived.\"", "\"Thanks, Mom,\" said Amara, still feeling glum.", "\"It will feel like home soon, I promise.\"", "Her mom placed the magazine and Amara's bat books on the bed and then gave her a hug."], ["Amara opened her magazine and started to read....", "There was a story about young people organizing beach cleanups to clear plastic from the oceans.", "And another story about a boy teaching people to connect with nature by writing a blog and fighting to protect endangered birds."], ["She found lots of stories and videos online about kids taking action to help animals and the planet.", "Soon, Amara realized: if they could make a difference, so could she.", "And she had an idea!"], ["Amara showed her mom and Samir a picture of a bat house, a little wooden house built for bats to roost in.", "\"Maybe if we can help the park build some bat houses, the bats will come back?", "We have to try to save the park!\""], ["She decided to talk about her idea for show-and-tell the next day.", "She was still new at school, so she was a bit nervous to stand up in front of her class."], ["But Amara didn't have to worry, because her classmates really wanted to help!", "They started to tell her about their favorite animals.", "Jasper loved tigers, and Lucy loved pangolins--their favorite animals were endangered too."], ["When Amara told Jasper and Lucy more about the bat houses, they had some great ideas.", "\"We could have a bake sale,\" said Jasper.", "\"And paint signs!\"", "Lucy waved her paintbrush.", "What if they could build a nature reserve in the park so that lots of wild animals would have a home in the city?", "Amara felt inspiration bubbling up inside her.", "She loved a challenge!"], [], ["The entire class painted signs and baked cakes to raise money for the nature reserve.", "Amara's new friends all wanted to help the bats come home!", "She was so happy."], ["Amara's mom made some important phone calls, and soon, their neighborhood gathered together to hold up their painted signs."], ["It was hard work, but eventually, people listened.", "The park would get its nature reserve!"], ["Over the next few months, volunteers helped make a bat-friendly sanctuary--a wild place where nature could flourish in the park.", "They made a new pond and planted flowers that smelled nice at nighttime, so lots of insects could come by for the bats to eat.", "Bat houses need the perfect location with enough sunlight, placed at least twelve feet high."], ["Let the grass and local plants grow wild!", "Avoid using pesticides.", "Grow hedges to help bats navigate and give other animals a home.", "Many bats love eating insects, and ponds help attract lots of them.", "Pile up dead leaves or logs to attract insects and small mammals.", "Pale flowers attract night-flying insects for bats to eat."], ["The park ranger put the bat houses up in a special place with help from the wildlife rescue team."], ["\"I hope they comeback!\"", "Amara said thoughtfully, sipping her hot chocolate.", "\"We might have to wait a while,\" the ranger replied.", "\"It's okay; I can wait.\""], ["Every month Amara and her family would check to see if the bats had roosted.", "They waited, and waited, and waited...", "But the bats didn't come."], ["Amara tried to stay brave."], ["One day, when Amara was eating pancakes for dinner, her mom got a phone call-they needed to go to the park right away!", "When they arrived, the ranger waved them over."], ["Amara was nervous.", "Had something happened to the bat houses?", "Suddenly, her mom and brother whispered,\"Amara,look!\""], ["And there they were,flying above her!", "The bats had made a new home, and Amara felt at home too."], ["It was the best feeling in the world."]]